/*

ArdaBot by Yuri Shevchenko, 2019
Автоматическая прокачка персонажей MUD-сервера arda.pp.ru

explore.c - проход текущей зоны

*/


#include "main.h"
#include <math.h>


extern void pushTask( int );


struct mobData {
	char *desc;
	char *targ;
	char *killCheck;
	int minLevel;
};

struct routeData {
	char *room;
	char *comm;
};

struct forkData {
	int step;
	int skip;
	int minLevel;
};

struct castData {
	char *spell;
	int minLevel;
};

struct wieldData {
	char *weapon;
	int minLevel;
};


const struct castData cast[] = {
	{ "\'черная молния\'", 50 },
	{ "\'едкий фонтан\'", 38 },
	{ "\'магнитный рывок\'", 31 },
	{ "\'серные брызги\'", 22 },
	{ "\'призрачное искажение\'", 18 },
	{ "электрокнут", 11 },
	{ "", 0 }
};


const struct wieldData wield[] = {
	{ "\'черный нож\'", 49 },
	{ "\'опасная бритва\'", 34 },
	{ "\'кинжал охтара\'", 24 },
	{ "\'кинжал видения\'", 5 },
	{ "", 0 }
};


bool mob_in_kill_range( int bot, int mob )
{
	if ( bot >= mob && bot <= mob + ( int ) sqrt( ( double ) mob ) + 5 )
		return true;
	return false;
}


// Проход зоны

bool task_explore( const struct mobData *mob, const struct routeData *route, const struct forkData *fork )
{
	// Игнорировать некоторые данные
	
	if ( strstr( buff.remote, "\e[0mВы открываете" ) || 
	strstr( buff.remote, "Уже открыто." ) )
		return false;
	
	if ( strstr( buff.remote, "Вы взЯли цирковой билет." ) )
		return false;
	
	// Реакция на "обезоружить"
	
	bool disarmed = false; // не static
	
	if ( strstr( buff.remote, "оружие у вас из рук!" ) ) {

		char *weapon;

		for ( int i = 0; wield[ i ].weapon[ 0 ] != '\0'; i++ )
			if ( bot.level >= wield[ i ].minLevel ) {
				weapon = wield[ i ].weapon;
				break;
			}

		strcpy( buff.aiComm, "взять " );
		strcat( buff.aiComm, weapon );
		strcat( buff.aiComm, "\nнадеть " );
		strcat( buff.aiComm, weapon );
		strcat( buff.aiComm, "\n" );

		disarmed = true;
	}

	// Бой

	if ( bot.castSent && strstr( buff.remote, "Вы засмеЯлись зловещим смехом \'МУХАХАХАХА!\'" ) )
		bot.castSent = false;

	if ( bot.fight ) {
		
		// Выйти из бот-режима при угрозе жизни
		
		if ( bot.hp <= bot.hpMax / 3 ) {
			bot.step = 0;
			return true;
		}
		
		// Кастовать заклинание
		
		if ( !bot.castSent && !disarmed && bot.mana > MIN_MANA && bot.level > BREE_LEVEL ) {
			
			char *spell;
			
			for ( int i = 0; cast[ i ].spell[ 0 ] != '\0'; i++ )
				if ( bot.level >= cast[ i ].minLevel ) {
					spell = cast[ i ].spell;
					break;
				}
			
			// Поменять заклинание в зависимости от зоны
			
			if ( bot.area == AREA_ALLEY && bot.step == 31 )
				spell = cast[ 4 ].spell; // Призрачное искажение (серные не действуют)
			
			// Колдовать
			
			strcpy( buff.aiComm, "колдовать " );
			strcat( buff.aiComm, spell );
			strcat( buff.aiComm, "\nмухаха\n" );
			
			bot.castSent = true;
		}

		if ( bot.killSent && strstr( buff.remote, mob[ bot.killMob ].killCheck ) )
			bot.killSent = false;

		return false;
	}

	// Осмотреться после боя
	
	if ( bot.killSent || ( strstr( buff.remote, "\e[0;1;31m убит!" ) || 
	strstr( buff.remote, "\e[0;1;31m убита!" ) ) ) {
		
		if ( bot.killSent ) {
			if ( !strstr( buff.remote, mob[ bot.killMob ].killCheck ) && 
			!strstr( buff.remote, "Здесь таких нет." ) )
				return false;
			bot.killSent = false;
		}
		
		if ( !disarmed )
			strcpy( buff.aiComm, "смотреть\n" );
		else
			strcat( buff.aiComm, "смотреть\n" );

		bot.lookSent = true;
		return false;
	}
	
	// Убедиться, что комната осмотрена
	
	if ( bot.lookSent ) {
		if ( !strstr( buff.remote, "Выходы: " ) )
			return false;
		bot.lookSent = false;
	}
	
	// Проверить способность к дальнейшим действиям
	
	if ( ( bot.hp <= MIN_HP ) || ( bot.mana <= MIN_MANA ) || ( bot.move <= MIN_MOVE ) ) {
		bot.step = 0;
		return true;
	}
	
	// Проверить наличие мобов, на которых можно напасть
	
	for ( int i = 0; mob[ i ].desc[ 0 ] != '\0'; i++ )
		
		if ( strstr( buff.remote, mob[ i ].desc ) && 
		mob_in_kill_range( bot.level, mob[ i ].minLevel ) ) {

			strcpy( buff.aiComm, "убить " );
			strcat( buff.aiComm, mob[ i ].targ );
			strcat( buff.aiComm, "\n" );
			bot.killMob = i;
			bot.killSent = true;
			return false;
		}

	// Когда мобов нет (или на них опасно нападать), идти дальше по маршруту
	
	if ( route[ bot.step ].room[ 0 ] != '\0' )
	
		if ( strstr( buff.remote, route[ bot.step ].room ) ) {
			
			if ( fork != NULL && bot.step == fork->step && bot.level < fork->minLevel )
				bot.step = fork->skip;

			strcpy( buff.aiComm, route[ bot.step++ ].comm );
			return false;
		}
		else {
			strcpy( buff.aiComm, "смотреть\n" );
			bot.lookSent = true;
			return false;
		}
	
	bot.step = 0;
	return true;	
}


// Нора

const struct mobData HoleMob[] = {
	{ "ТолстаЯ белаЯ личинка мерзко извиваетсЯ в грЯзи.", "личинка", "Личинка\e[0;1;31m убита!", 2 },
	{ "БольшаЯ жужелица с черными и прочными хитиновыми надкрыльЯми.", "жужелица", "Жужелица\e[0;1;31m убита!", 2 },
	{ "ПротивнаЯ сераЯ муха назойливо жужжит.", "муха", "Муха\e[0;1;31m убита!", 3 },
	{ "Розовый дождевой червЯк наполовину выполз из земли.", "червяк", "Дождевой червЯк\e[0;1;31m убит!", 4 },
	{ "МаленькаЯ коричневаЯ лЯгушка затаилась в углу.", "лягушка", "ЛЯгушка\e[0;1;31m убита!", 4 },
	{ "Маленький серый крот копошитсЯ в земле.", "крот", "Крот\e[0;1;31m убит!", 5 },
	{ "Маленький розовый крысенок копошитсЯ в крысином гнезде.", "крысенок", "Маленький крысенок\e[0;1;31m убит!", 3 },
	{ "ТощаЯ крыса вылизывает свои голые лапки.", "тощая", "ТощаЯ крыса\e[0;1;31m убита!", 5 },
	{ "ОгромнаЯ толстаЯ крыса сверкает глазами из темного угла.", "толстая", "ТолстаЯ крыса\e[0;1;31m убита!", 5 },
	{ "", "", "", 0 }
};

const struct routeData HoleRoute[] = {
	{ "Вход в заброшенную нору.", "с\n" },
	{ "ПрихожаЯ.", "в\n" },
	{ "ГостинаЯ.", "с\n" },
	{ "ГостинаЯ.", "в\n" },
	{ "ГостинаЯ.", "ю\n" },
	{ "ГостинаЯ.", "в\n" },
	{ "Коридор.", "в\n" },
	{ "СпальнЯ.", "в\n" },
	{ "СпальнЯ.", "открыть север\nсевер\n" },
	{ "В шкафу.", "открыть юг\nюг\n" },
	{ "СпальнЯ.", "з\n" },
	{ "СпальнЯ.", "з\n" },
	{ "Коридор.", "с\n" },
	{ "МаленькаЯ кухнЯ.", "с\n" },
	{ "Путь в кладовку.", "с\n" },
	{ "ВместительнаЯ кладовка.", "с\n" },
	{ "ВместительнаЯ кладовка.", "в\n" },

	{ "ВместительнаЯ кладовка.", "войти\n" }, /* step 17 */
	{ "КрысинаЯ нора.", "с\n" },
	{ "Крысиные тоннели.", "в\n" },
	{ "Крысиные тоннели.", "в\n" },
	{ "Крысиное жилище.", "с\n" },
	{ "ГадкаЯ крысинаЯ нора.", "ю\n" },
	{ "Крысиное жилище.", "ю\n" },
	{ "ГадкаЯ крысинаЯ нора.", "с\n" },
	{ "Крысиное жилище.", "в\n" },
	{ "Зальчик.", "ю\n" },
	{ "Кладовка.", "с\n" },
	{ "Зальчик.", "з\n" },
	{ "Крысиное жилище.", "з\n" },
	{ "Крысиные тоннели.", "з\n" },
	{ "Крысиные тоннели.", "ю\n" },
	{ "КрысинаЯ нора.", "вв\n" },

	{ "ВместительнаЯ кладовка.", "ю\n" }, /* skip 33 */
	{ "ВместительнаЯ кладовка.", "з\n" },
	{ "ВместительнаЯ кладовка.", "ю\n" },
	{ "Путь в кладовку.", "ю\n" },
	{ "МаленькаЯ кухнЯ.", "ю\n" },
	{ "Коридор.", "з\n" },
	{ "ГостинаЯ.", "з\n" },
	{ "ГостинаЯ.", "з\n" },
	{ "ПрихожаЯ.", "ю\n" },
	{ "", "" }
};
	
const struct forkData HoleFork = { .step = 17, .skip = 33, .minLevel = 5 };
	

// Забытый приют

const struct mobData ForsakenMob[] = {
	{ "ПлатЯнаЯ вошь копошитсЯ в тюфЯке.", "вошь", "Вошь\e[0;1;31m убита!", 2 },
	{ "ПлатЯнаЯ вошь медленно ползет по грЯзной простыне.", "вошь", "Вошь\e[0;1;31m убита!", 2 },
	{ "Постельный клоп ищет, кого бы искусать.", "клоп", "Клоп\e[0;1;31m убит!", 3 },
	{ "КусачаЯ блоха прыгает по комнате.", "блоха", "Блоха\e[0;1;31m убита!", 3 },
	{ "Большой сверчок ползает, шевелЯ длинными усами.", "сверчок", "Сверчок\e[0;1;31m убит!", 4 },
	{ "ГигантскаЯ моль ищет, чью бы одежду попортить.", "моль", "Моль\e[0;1;31m убита!", 5 },
	{ "Пестрый петух сидит в клетке.", "петух", "Пестрый петух\e[0;1;31m убит!", 5 },
	{ "Мороженый цыпленок, поджав лапы, лежит среди льда.", "цыпленок", "Мороженый цыпленок\e[0;1;31m убит!", 8 },
	{ "Гном-загребущие-руки повис на краю стола, его ноги болтаютсЯ в воздухе.", "гном", "Гном-загребущие-руки\e[0;1;31m убит!", 8 },
	{ "Гадкий полуорк ничего не замечает вокруг, нагнувшись над столом.", "полуорк", "Гадкий полуорк\e[0;1;31m убит!", 8 },
	{ "", "", "", 0 }
};

const struct routeData ForsakenRoute[] = {
	{ "Пустой зал \'Забытого приюта\'.", "в\n" },
	{ "Пустой зал.", "с\n" },
	{ "У двери.", "в\n" },
	{ "Коридор.", "в\n" },
	{ "Коридор таверны.", "открыть юг\nюг\n" },
	{ "Комнатка.", "открыть север\nсевер\n" },
	{ "Коридор таверны.", "открыть север\nсевер\n" },
	{ "Номер-нора.", "з\n" },
	{ "Номер-нора.", "в\n" },
	{ "Номер-нора.", "открыть юг\nюг\n" },
	{ "Коридор таверны.", "в\n" },
	{ "Коридор.", "в\n" },
	{ "Конец коридора.", "ю\n" },
	{ "Кладовка.", "ю\n" },
	{ "ПрачечнаЯ.", "с\n" },
	{ "Кладовка.", "открыть вниз\nвниз\n" },
	{ "Подвал.", "ю\n" },
	{ "Ледник.", "с\n" },
	{ "Подвал.", "открыть вверх\nвверх\n" },
	{ "Кладовка.", "с\n" },
	{ "Конец коридора.", "с\n" },
	{ "Низ лестницы.", "вв\n" },
	{ "Верх лестницы.", "ю\n" },
	{ "Фойе.", "в\n" },
	{ "ДушеваЯ", "з\n" },
	{ "Фойе.", "з\n" },
	{ "В углу.", "ю\n" },
	{ "У разбитой двери.", "з\n" },
	{ "Пыльный коридор.", "з\n" },
	{ "Между дверЯми.", "открыть юг\nюг\n" },
	{ "Клоповник.", "открыть север\nсевер\n" },
	{ "Между дверЯми.", "открыть север\nсевер\n" },
	{ "Комната прислуги.", "открыть вверх\nвверх\n" },
	{ "Чердак.", "открыть вниз\nвниз\n" },
	{ "Комната прислуги.", "открыть юг\nюг\n" },
	{ "Между дверЯми.", "з\n" },
	{ "Перед апартаментами.", "открыть запад\nзапад\n" },
	{ "Апартаменты.", "з\n" },
	{ "У стола.", "в\n" },
	{ "Апартаменты.", "открыть восток\nвосток\n" },
	{ "Перед апартаментами.", "в\n" },
	{ "Между дверЯми.", "в\n" },
	{ "Пыльный коридор.", "в\n" },
	{ "У разбитой двери.", "в\n" },
	{ "У камина.", "с\n" },
	{ "Фойе.", "с\n" },
	{ "Верх лестницы.", "вн\n" },
	{ "Низ лестницы.", "ю\n" },
	{ "Конец коридора.", "з\n" },
	{ "Коридор.", "з\n" },
	{ "Коридор таверны.", "з\n" },
	{ "Коридор.", "з\n" },
	{ "У двери.", "з\n" },
	{ "Угол пустого зала.", "ю\n" },
	{ "", "" }
};
	

// Ров вокруг БрылЯ
	
const struct mobData MoatMob[] = {
	{ "Черепашка медленно ползет мимо.", "черепашка", "Черепашка\e[0;1;31m убита!", 3 },
	{ "МаленькаЯ змеЯ с шипением поднимает свою треугольную голову.", "змея", "МаленькаЯ змеЯ\e[0;1;31m убита!", 3 },
	{ "Кривоногий человечек быстро семенит по своим делам. Он очень занЯт.", "человечек", "Кривоногий человечек\e[0;1;31m убит!", 4 },
	{ "Тарантул резво бежит на своих восьми ногах.", "тарантул", "Тарантул\e[0;1;31m убит!", 5 },
	{ "СераЯ жаба скорчилась в комочек, стараЯсь сделатьсЯ незаметной.", "жаба", "Жаба\e[0;1;31m убита!", 6 },
	{ "ГигантскаЯ сколопендра шуршит своими кольцами, мерзко извиваЯсь.", "сколопендра", "Сколопендра\e[0;1;31m убита!", 6 },
	{ "", "", "", 0 }
};

const struct routeData MoatRoute[] = {
	{ "Под насыпью.", "с\n" },
	{ "ГрЯзнаЯ труба.", "с\n" },
	{ "Ров вокруг БрылЯ.", "с\n" },
	{ "Ров вокруг БрылЯ.", "с\n" },
	{ "Ров вокруг БрылЯ.", "с\n" },
	{ "Угол рва.", "в\n" },
	{ "Ров вокруг БрылЯ.", "в\n" },
	{ "Ров вокруг БрылЯ.", "в\n" },
	{ "Ров вокруг БрылЯ.", "в\n" },
	{ "Ров вокруг БрылЯ.", "в\n" },
	{ "Ров вокруг БрылЯ.", "в\n" },
	{ "Ров вокруг БрылЯ.", "в\n" },
	{ "Ров вокруг БрылЯ.", "в\n" },
	{ "Угол рва.", "ю\n" },
	{ "Ров вокруг БрылЯ.", "ю\n" },
	{ "Ров вокруг БрылЯ.", "ю\n" },
	{ "Ров вокруг БрылЯ.", "ю\n" },
	{ "Ров вокруг БрылЯ.", "ю\n" },
	{ "Ров вокруг БрылЯ.", "ю\n" },
	{ "Ров вокруг БрылЯ.", "ю\n" },
	{ "Ров вокруг БрылЯ.", "ю\n" },
	{ "Угол рва.", "з\n" },
	{ "Ров вокруг БрылЯ.", "з\n" },
	{ "Ров вокруг БрылЯ.", "з\n" },
	{ "Ров вокруг БрылЯ.", "з\n" },
	{ "ГрЯзнаЯ труба.", "з\n" },
	{ "Под насыпью.", "з\n" },
	{ "Ров вокруг БрылЯ.", "з\n" },
	{ "Ров вокруг БрылЯ.", "з\n" },
	{ "Ров вокруг БрылЯ.", "з\n" },
	{ "Угол рва.", "с\n" },
	{ "Ров вокруг БрылЯ.", "с\n" },
	{ "Ров вокруг БрылЯ.", "с\n" },
	{ "Ров вокруг БрылЯ.", "с\n" },
	{ "", "" }
};
	

// ОсобнЯк

const struct mobData ManorMob[] = {
	{ "Колли приближаетсЯ к вам.", "колли", "Колли\e[0;1;31m убита!", 3 },
	{ "БольшаЯ крыса суетливо бегает туда-сюда.", "большая", "БольшаЯ крыса\e[0;1;31m убита!", 3 },
	{ "ОгромнаЯ крыса шарахнулась из-под ваших ног.", "огромная", "ОгромнаЯ крыса\e[0;1;31m убита!", 4 },
	{ "ТолстаЯ повариха готовит еду.", "повариха", "ТолстаЯ повариха\e[0;1;31m убита!", 4 },
	{ "Гигантский таракан шевелит усами.", "таракан", "Гигантский таракан\e[0;1;31m убит!", 5 },
	{ "ГремучаЯ змеЯ выползла поохотитьсЯ.", "змея", "ГремучаЯ змеЯ\e[0;1;31m убита!", 5 },
	{ "СтараЯ нЯнЯ с улыбкой вспоминает проказы своей юности.", "няня", "СтараЯ нЯнЯ\e[0;1;31m убита!", 5 },
	{ "ДедулЯ читает книжку, покуриваЯ свою трубку.", "дедуля", "ДедулЯ\e[0;1;31m убит!", 5 },
	{ "ЕздоваЯ лошадь выглЯдит сильной и выносливой.", "лошадь", "ЕздоваЯ лошадь\e[0;1;31m убита!", 6 },
	{ "Старый конюх чистит конюшни.", "конюх", "Конюх\e[0;1;31m убит!", 6 },
	{ "Садовник в поте лица собирает свежие овощи.", "садовник", "Садовник\e[0;1;31m убит!", 7 },
	{ "ХозЯйка крайне смущена вашим вторжением.", "хозяйка", "ХозЯйка\e[0;1;31m убита!", 8 },
	{ "ХозЯин Явно недоволен вашим присутствием в своем доме.", "хозЯин", "Мастер\e[0;1;31m убит!", 9 },
	{ "", "", "", 0 }
};

const struct routeData ManorRoute[] = {
	{ "Фойе.", "открыть люк\nвниз\n" },
	{ "Подвал.", "открыть юг\nюг\n" },
	{ "Лестница.", "вв\n" },
	{ "ГостинаЯ.", "з\n" },
	{ "Фойе.", "с\n" },
	{ "Богато обставленнаЯ комната.", "вн\n" },
	{ "СекретнаЯ комната.", "вн\n" },
	{ "Подвал.", "в\n" },
	{ "Лабиринт.", "ю\n" },
	{ "Лабиринт.", "ю\n" },
	{ "Лабиринт.", "ю\n" },
	{ "Лабиринт.", "в\n" },
	{ "Лабиринт.", "с\n" },
	{ "Лабиринт.", "в\n" },
	{ "Лабиринт.", "юв\n" },
	{ "Пересечение.", "ю\n" },
	{ "Лабиринт.", "ю\n" },
	{ "Лабиринт.", "з\n" },
	{ "Лабиринт.", "з\n" },
	{ "Лабиринт.", "з\n" },
	{ "Перекресток.", "с\n" },
	{ "Лабиринт.", "ю\n" },
	{ "Перекресток.", "з\n" },
	{ "Лабиринт.", "ю\n" },
	{ "Лабиринт.", "в\n" },
	{ "Лабиринт.", "ю\n" },
	{ "Лабиринт.", "в\n" },
	{ "Лабиринт.", "с\n" },
	{ "Лабиринт.", "с\n" },
	{ "Лабиринт.", "в\n" },
	{ "Лабиринт.", "ю\n" },
	{ "Лабиринт.", "юв\n" },
	{ "Лабиринт.", "в\n" },
	{ "Лабиринт.", "с\n" },
	{ "Лабиринт.", "с\n" },
	{ "Лабиринт.", "сз\n" },
	{ "Лабиринт.", "с\n" },
	{ "Пересечение.", "юв\n" },
	{ "Лабиринт.", "с\n" },
	{ "Лабиринт.", "с\n" },
	{ "Лабиринт.", "з\n" },
	{ "Лабиринт.", "с\n" },
	{ "Лабиринт.", "сз\n" },
	{ "Лабиринт.", "с\n" },
	{ "Лабиринт.", "с\n" },
	{ "Лабиринт.", "в\n" },
	{ "Отвратительное логово.", "з\n" },
	{ "Лабиринт.", "ю\n" },
	{ "Лабиринт.", "ю\n" },
	{ "Лабиринт.", "ю\n" },
	{ "Лабиринт.", "з\n" },
	{ "Пересечение.", "з\n" },
	{ "Лабиринт.", "с\n" },
	{ "Лабиринт.", "з\n" },
	{ "Подвал.", "вв\n" },
	{ "СекретнаЯ комната.", "вв\n" },
	{ "Богато обставленнаЯ комната.", "в\n" },
	{ "Кабинет.", "з\n" },
	{ "Богато обставленнаЯ комната.", "с\n" },
	{ "КухнЯ", "открыть север\nсевер\n" },
	{ "Задний двор.", "с\n" },
	{ "На заднем дворе.", "в\n" },
	{ "Пересечение.", "с\n" },
	{ "Сад.", "ю\n" },
	{ "Пересечение.", "в\n" },
	{ "Вход в конюшню.", "открыть восток\nвосток\n" },
	{ "Стойла.", "ю\n" },
	{ "Хранилище снарЯжениЯ длЯ езды.", "с\n" },
	{ "Стойла.", "с\n" },
	{ "Поле.", "с\n" },
	{ "Поле.", "з\n" },
	{ "Поле.", "ю\n" },
	{ "Поле.", "в\n" },
	{ "Поле.", "ю\n" },
	{ "Стойла.", "открыть запад\nзапад\n" },
	{ "Вход в конюшню.", "з\n" },
	{ "Пересечение.", "з\n" },
	{ "На заднем дворе.", "ю\n" },
	{ "Задний двор.", "открыть юг\nюг\n" },
	{ "КухнЯ.", "ю\n" },
	{ "Богато обставленнаЯ комната.", "вв\n" },
	{ "Второй этаж.", "ю\n" },
	{ "Темный коридор на втором этаже.", "открыть юг\nюг\n" },
	{ "Комната старой нЯни.", "открыть север\nсевер\n" },
	{ "Темный коридор на втором этаже.", "с\n" },
	{ "Второй этаж.", "с\n" },
	{ "Второй этаж.", "открыть север\nсевер\n" },
	{ "СпальнЯ ХозЯина.", "открыть восток\nвосток\n" },
	{ "ХозЯйскаЯ ваннаЯ.", "открыть запад\nзапад\n" },
	{ "СпальнЯ ХозЯина.", "открыть юг\nюг\n" },
	{ "Второй этаж.", "ю\n" },
	{ "Второй этаж.", "вн\n" },
	{ "Богато обставленнаЯ комната.", "ю\n" },
	{ "Фойе.", "открыть юг\nюг\n" },
	{ "", "" }
};


// Мельница Тэда

const struct mobData TedsMob[] = {
	{ "МаленькаЯ мышка шуршит возле ваших ног.", "мышка", "СераЯ мышка\e[0;1;31m убита!", 5 },
	{ "Ободранный кот крадетсЯ за вами.", "кот", "Ободранный кот\e[0;1;31m убит!", 5 },
	{ "Маленький паучок плетет паутину.", "паучок", "Паучок\e[0;1;31m убит!", 5 },
	{ "Маленький пушистый паучок плетет паутину.", "паучок", "Паучок\e[0;1;31m убит!", 5 },
	{ "Маленький паучок с удивлением смотрит на вас.", "паучок", "Паучок\e[0;1;31m убит!", 5 },
	{ "Усталый рабочий тащит на себе огромный мешок.", "усталый", "Рабочий\e[0;1;31m убит!", 5 },
	{ "Косоглазый рабочий стоит тут.", "косоглазый", "Косоглазый рабочий\e[0;1;31m убит!", 5 },
	{ "Извилистый плющ обвилсЯ вокруг забора.", "плющ", "Плющ\e[0;1;31m убит!", 5 },
	{ "ТолстЯчок сыпет зерно в жернова.", "толстячок", "ТолстЯчок\e[0;1;31m убит!", 8 },
	{ "Кочегар стоит тут.", "кочегар", "Кочегар\e[0;1;31m убит!", 8 },
	{ "Кочегар-лентЯй спит на кушетке.", "кочегар", "Кочегар-лентЯй\e[0;1;31m убит!", 8 },
	{ "УхмылЯющийсЯ работник стоит с нахлобученными на голову наушниками.", "работник", "УхмылЯющийсЯ работник\e[0;1;31m убит!", 8 },
	{ "Угрюмый смотритель наблюдает за рабочими.", "смотритель", "Угрюмый смотритель\e[0;1;31m убит!", 8 },
	{ "Угрюмый дровосек колет здесь дрова.", "дровосек", "Дровосек\e[0;1;31m убит!", 8 },
	{ "Тэд Песошкинс стоит тут.", "тэд", "Тэд\e[0;1;31m убит!", 12 },
	{ "Краснощекий повар с большим ножом стоит тут.", "повар", "Краснощекий повар\e[0;1;31m убит!", 14 },
	{ "", "", "", 0 }
};

const struct routeData TedsRoute[] = {
	{ "Огромный вход.", "з\n" },
	{ "Большой коридор.", "з\n" },
	{ "Поворот коридора.", "з\n" },
	{ "Лестница.", "вв\n" },
	{ "Лестница.", "в\n" },
	{ "Небольшой уютный коридор.", "в\n" },
	{ "Коридорчик продолжаетсЯ.", "войти\n" },
	{ "СтараЯ лестница.", "вв\n" },
	{ "Чердак.", "з\n" },
	{ "Чердак.", "з\n" },
	{ "Чердак.", "в\n" },
	{ "Чердак.", "в\n" },
	{ "Чердак.", "ю\n" },
	{ "Чердак.", "в\n" },
	{ "Чердак.", "с\n" },
	{ "Чердак.", "в\n" },
	{ "Чердак.", "в\n" },
	{ "Чердак.", "з\n" },
	{ "Чердак.", "з\n" },
	{ "Чердак.", "з\n" },
	{ "Чердак.", "вн\n" },
	{ "СтараЯ лестница.", "ю\n" },
	
	{ "Коридорчик продолжаетсЯ.", "в\n" }, /* step 22 */
	{ "Поворот коридорчика.", "открыть восток\nвосток\n" },
	{ "КрохотнаЯ столоваЯ.", "в\n" },
	{ "КухнЯ.", "нажать стол\n" },
	{ "Колодец.", "вн\n" },
	{ "Колодец.", "вв\n" },
	{ "Колодец.", "вв\n" },
	{ "КухнЯ.", "з\n" },
	{ "КрохотнаЯ столоваЯ.", "открыть запад\nзапад\n" },
	{ "Поворот коридорчика.", "с\n" },
	{ "Уютный коридорчик продолжаетсЯ.", "с\n" },
	{ "Конец коридорчика.", "открыть восток\nвосток\n" },
	{ "ПрихожаЯ.", "в\n" },
	{ "СпальнЯ.", "з\n" },
	{ "ПрихожаЯ.", "открыть запад\nзапад\n" },
	{ "Конец коридорчика.", "ю\n" },
	{ "Уютный коридорчик продолжаетсЯ.", "ю\n" },
	{ "Поворот коридорчика.", "з\n" },

	{ "Коридорчик продолжаетсЯ.", "з\n" }, /* skp 40 */
	{ "Небольшой уютный коридор.", "з\n" },
	{ "Лестница.", "открыть север\nсевер\n" },
	{ "На мостах.", "с\n" },
	{ "На мостах.", "в\n" },
	{ "На мостах.", "ю\n" },
	{ "Над жерновами.", "с\n" },
	{ "На мостах.", "в\n" },
	{ "У мостов.", "ю\n" },
	{ "Настил между этажами.", "з\n" },
	{ "У жерновов.", "з\n" },
	{ "Угол мелильного зала.", "св\n" },
	{ "Продолжение мелильного зала.", "открыть восток\nвосток\n" },
	{ "Задний выход.", "открыть север\nсевер\n" },
	{ "Задний двор.", "з\n" },
	{ "Поленница.", "з\n" },
	{ "Край поленницы.", "в\n" },
	{ "Поленница.", "в\n" },
	{ "Задний двор.", "в\n" },
	{ "Задний двор.", "з\n" },
	{ "Задний двор.", "открыть юг\nюг\n" },
	{ "Задний выход.", "открыть вниз\nвниз\n" },
	{ "Вход в подвал.", "з\n" },
	{ "У топки.", "в\n" },
	{ "Вход в подвал.", "войти\n" },
	{ "Под жерновами.", "з\n" },
	{ "Подвал.", "в\n" },
	{ "Под жерновами.", "выйти\n" },
	{ "Вход в подвал.", "открыть юг\nюг\n" },
	{ "ТихаЯ каморка.", "открыть север\nсевер\n" },
	{ "Вход в подвал.", "открыть вверх\nвверх\n" },
	{ "Задний выход.", "открыть восток\nвосток\n" },
	{ "Склад.", "в\n" },
	{ "Склад.", "в\n" },
	{ "Склад.", "ю\n" },
	{ "Склад.", "з\n" },
	{ "Склад.", "з\n" },
	{ "Склад.", "открыть юг\nюг\n" },
	{ "Огромный вход.", "открыть восток\nвосток\n" },
	{ "Каморка Тэда.", "открыть запад\nзапад\n" },
	{ "", "" }
};

const struct forkData TedsFork = { .step = 22, .skip = 40, .minLevel = 14 };


// Крапива

const struct mobData NettleMob[] = {
	{ "ДикаЯ крапива широко раскинула свои жгучие листьЯ.", "крапива", "Крапива\e[0;1;31m убита!", 8 },
	{ "", "", "", 0 }
};

const struct routeData NettleRoute[] = {
	{ "В самом центре зарослей.", "с\n" },
	{ "В кустах.", "ю\n" },
	{ "В самом центре зарослей.", "в\n" },
	{ "В зарослЯх.", "в\n" },
	{ "", "" }
};


// Уводье

const struct mobData BywaterMob[] = {
	{ "Серый паучок мирно плетет паутинку длЯ мух.", "серый", "Серый паук\e[0;1;31m убит!", 8 },
	{ "Сизый голубь сидит рЯдом, нахохлившись на жердочке.", "сизый", "Сизый голубь\e[0;1;31m убит!", 8 },
	{ "Перед вами белаЯ голубка с шикарным хвостом из белоснежных перьев.", "белая", "БелаЯ голубка\e[0;1;31m убита!", 8 },
	{ "Молодой дуб зеленеет возле забора.", "дуб", "Молодой дуб\e[0;1;31m убит!", 12 },
	{ "Старый конюх скучает один среди пустых стойл.", "конюх", "Старый конюх\e[0;1;31m убит!", 14 },
	{ "Местный ширриф высматривает пьЯных белочек.", "ширриф", "Ширриф\e[0;1;31m убит!", 14 },
	{ "Супруга трактирщика сидит у трюмо.", "супруга", "Супруга трактирщика\e[0;1;31m убита!", 14 },
	{ "БольшаЯ овчарка высунула голову из будки и положила ее на лапы.", "овчарка", "БольшаЯ овчарка\e[0;1;31m убита!", 14 },
	{ "ПьЯный хоббит присел пропустить кружечку.", "пьяный", "ПьЯный хоббит\e[0;1;31m убит!", 16 },
	{ "", "", "", 0 }
};

const struct routeData BywaterRoute[] = {
	{ "Плохо освещеннаЯ прихожаЯ.", "открыть север\nсевер\n" },
	{ "Вход в зал.", "с\n" },
	{ "Около очага.", "з\n" },
	{ "Около стойки.", "ю\n" },
	{ "Продолжение зала.", "в\n" },
	{ "Вход в зал.", "открыть юг\nюг\n" },
	{ "Плохо освещеннаЯ прихожаЯ.", "открыть запад\nзапад\n" },
	{ "Под лестницей.", "вверх\n" },
	{ "Верх лестницы.", "открыть восток\nвосток\n" },
	{ "Коридор второго этажа.", "с\n" },
	{ "Две двери.", "открыть запад\nзапад\n" },
	{ "СпальнЯ хозЯев.", "открыть восток\nвосток\n" },
	{ "Две двери.", "с\n" },
	{ "У окна.", "в\n" },
	{ "Ход на чердак.", "вв\n" },
	{ "Чердак.", "ю\n" },
	{ "ГолубЯтнЯ.", "з\n" },
	{ "ГолубЯтнЯ.", "в\n" },
	{ "ГолубЯтнЯ.", "с\n" },
	{ "Чердак.", "вн\n" },
	{ "Ход на чердак.", "з\n" },
	{ "У окна.", "ю\n" },
	{ "Две двери.", "ю\n" },
	{ "Коридор второго этажа.", "открыть запад\nзапад\n" },
	{ "Верх лестницы.", "вн\n" },
	{ "Под лестницей.", "открыть восток\nвосток\n" },
	{ "Плохо освещеннаЯ прихожаЯ.", "открыть восток\nвосток\n" },
	{ "Двор перед конюшней.", "открыть восток\nвосток\n" },
	{ "КонюшнЯ при трактире.", "открыть запад\nзапад\n" },
	{ "Двор перед конюшней.", "с\n" },
	{ "Двор.", "с\n" },
	{ "Двор.", "с\n" },
	{ "Двор возле построек.", "з\n" },
	{ "Подсобное помещение.", "открыть север\nсевер\n" },

	{ "Комната с паутиной.", "открыть запад\nзапад\n" }, /* step 34 */
	{ "ОбширнаЯ кладовка.", "открыть вниз\nвниз\n" },
	{ "Подпол.", "открыть вверх\nвверх\n" },
	{ "ОбширнаЯ кладовка.", "открыть восток\nвосток\n" },

	{ "Комната с паутиной.", "открыть юг\nюг\n" }, /* skip 38 */
	{ "Подсобное помещение.", "в\n" },
	{ "Двор возле построек.", "с\n" },
	{ "Двор.", "с\n" },
	{ "Вдоль забора.", "з\n" },
	{ "Двор позади трактира.", "з\n" },
	{ "Продолжение заднего двора.", "с\n" },
	{ "У забора.", "ю\n" },
	{ "Продолжение заднего двора.", "в\n" },
	{ "Двор позади трактира.", "в\n" },
	{ "Вдоль забора.", "ю\n" },
	{ "Двор.", "ю\n" },
	{ "Двор возле построек.", "ю\n" },
	{ "Двор.", "ю\n" },
	{ "Двор.", "ю\n" },
	{ "Двор перед конюшней.", "открыть запад\nзапад\n" },
	{ "", "" }
};

const struct forkData BywaterFork = { .step = 34, .skip = 38, .minLevel = 14 };


// Древлепуща

const struct mobData ForestMob[] = {
	{ "Куст бузины качает тонкими ветвЯми.", "бузина", "Бузина\e[0;1;31m убита!", 10 },
	{ "Куст шиповника ронЯет лепестки своих алых цветов.", "куст", "Куст шиповника\e[0;1;31m убит!", 10 },
	{ "ПрогнившаЯ корЯга покрыта пЯтнами плесени.", "коряга", "КорЯга\e[0;1;31m убита!", 12 },
	{ "Ясень устремлЯет свои ветви к небу.", "ясень", "Ясень\e[0;1;31m убит!", 14 },
	{ "КорЯваЯ осина тЯнет к вам свои голые сучьЯ.", "осина", "КорЯваЯ осина\e[0;1;31m убита!", 18 },
	{ "Древний дуб с толстым стволом возвышаетсЯ над вами.", "дуб", "Дуб\e[0;1;31m убит!", 19 },
	{ "", "", "", 0 }
};

const struct routeData ForestRoute[] = {
	{ "Перед Заплотом.", "ю\n" },
	{ "Вдоль Заплота.", "ю\n" },
	{ "У Заплота.", "ю\n" },
	{ "У Заплота.", "ю\n" },
	{ "Западный край леса.", "в\n" },
	{ "Склон, поросший лесом.", "в\n" },
	{ "Вершина холма.", "ю\n" },
	{ "Склон, поросший лесом.", "с\n" },
	{ "Вершина холма.", "в\n" },
	{ "Тропа по берегу Ивлинки.", "в\n" },
	{ "Воды Ивлинки.", "в\n" },
	{ "Ивлинка.", "в\n" },
	{ "На берегу.", "в\n" },
	{ "За рекой.", "в\n" },
	{ "ЯсеневаЯ роща.", "с\n" },
	{ "Около импровизированного моста.", "в\n" },
	{ "Перед зарослЯми камыша.", "в\n" },
	{ "В глубине Древлепущи.", "с\n" },
	{ "Резкий подъем.", "ю\n" },
	{ "В глубине Древлепущи.", "з\n" },
	{ "Перед зарослЯми камыша.", "з\n" },
	{ "Около импровизированного моста.", "с\n" },
	{ "Бревно-мост.", "с\n" },
	{ "Тропинка сворачивает.", "с\n" },
	{ "Возле дома.", "з\n" },
	{ "Лужайка перед домом.", "з\n" },
	{ "Заросли шиповника.", "в\n" },
	{ "Лужайка перед домом.", "в\n" },
	{ "Возле дома.", "войти\n" },
	{ "", "" }
};


// Усадьба Мэггота

const struct mobData MaggotsMob[] = {
	{ "Жаворонок сидит на ветке.", "жаворонок", "Жаворонок\e[0;1;31m убит!", 10 },
	{ "Пони увлеченно что-то жует.", "пони", "Пони\e[0;1;31m убит!", 10 },
	{ "Пес Мэггота по кличке Волк с громким лаем бежит вам навстречу.", "волк", "Волк\e[0;1;31m убит!", 14 },
	{ "Клык, грозно ворча, смотрит на вас.", "клык", "Клык\e[0;1;31m убит!", 14 },
	{ "Хват, большой пес Мэггота, оскалил на вас зубы.", "хват", "Хват\e[0;1;31m убит!", 14 },
	{ "", "", "", 0 }
};

const struct routeData MaggotsRoute[] = {
	{ "УтрамбованнаЯ дорожка.", "в\n" },
	{ "Калитка.", "открыть восток\nвосток\n" },
	{ "Лужайка перед домом.", "ю\n" },
	{ "РЯдом с поленницей.", "ю\n" },
	{ "Около огромной будки.", "с\n" },
	{ "РЯдом с поленницей.", "с\n" },
	{ "Лужайка перед домом.", "с\n" },
	{ "Колодец.", "с\n" },
	{ "Угол усадьбы.", "в\n" },
	{ "Двор продолжаетсЯ.", "в\n" },
	{ "Возле конюшни.", "открыть север\nсевер\n" },
	{ "КонюшнЯ.", "открыть юг\nюг\n" },
	{ "Возле конюшни.", "в\n" },
	{ "ТенистаЯ аллеЯ.", "с\n" },
	{ "Плодовый сад.", "в\n" },
	{ "Плодовый сад.", "ю\n" },
	{ "ТенистаЯ аллеЯ.", "в\n" },
	{ "Восточные ворота.", "з\n" },
	{ "ТенистаЯ аллеЯ.", "ю\n" },
	{ "Клубничные грЯдки.", "з\n" },
	{ "У завалинки.", "в\n" },
	{ "Клубничные грЯдки.", "ю\n" },
	{ "Ровные грЯдки.", "ю\n" },
	{ "На огороде.", "ю\n" },
	{ "Картофельные грЯдки.", "з\n" },
	{ "Огород с грибами.", "с\n" },
	{ "", "" }
};


// Южные увалы

const struct mobData SouthMob[] = {
	{ "БольшаЯ летучаЯ мышь спит, крепко вцепившись в потолок.", "мышь", "БольшаЯ летучаЯ мышь\e[0;1;31m убита!", 10 },
	{ "Горный козел трЯсет головой, пытаЯсь напугать вас.", "козел", "Горный козел\e[0;1;31m убит!", 14 },
	{ "Речной рак пЯтитсЯ назад, выставив клешни.", "рак", "Речной рак\e[0;1;31m убит!", 14 },
	{ "Серое нечто почти незаметно на фоне стен пещеры.", "нечто", "Серое нечто\e[0;1;31m убито!", 14 },
	{ "Окруженный клубами светЯщейсЯ дымки, пещерный дух парит над землей.", "дух", "Пещерный дух\e[0;1;31m убит!", 16 },
	{ "", "", "", 0 }
};

const struct routeData SouthRoute[] = {
	{ "У подножиЯ горы.", "ю\n" },
	{ "Склон горы.", "з\n" },
	{ "К западу от дороги.", "в\n" },
	{ "Склон горы.", "в\n" },
	{ "На каменном карнизе.", "в\n" },
	{ "На каменном карнизе.", "ю\n" },
	{ "У гномской хибары.", "вн\n" },
	{ "На дне колодца.", "з\n" },
	{ "ПодземнаЯ река.", "ю\n" },
	{ "ПещернаЯ река.", "в\n" },
	{ "ТаинственнаЯ аллеЯ.", "с\n" },
	{ "ТаинственнаЯ аллеЯ.", "вн\n" },
	{ "Пещерный лабиринт.", "з\n" },
	{ "Пещерный лабиринт.", "с\n" },
	{ "Пещерный лабиринт.", "с\n" },
	{ "Пещерный лабиринт.", "з\n" },
	{ "Пещерный лабиринт.", "в\n" },
	{ "Пещерный лабиринт.", "юз\n" },
	{ "Пещерный лабиринт.", "юз\n" },
	{ "Пещерный лабиринт.", "з\n" },
	{ "Пещерный лабиринт.", "з\n" },
	{ "Пещерный лабиринт.", "сз\n" },
	{ "Пещерный лабиринт.", "с\n" },
	{ "Пещерный лабиринт.", "ю\n" },
	{ "Пещерный лабиринт.", "в\n" },
	{ "Пещерный лабиринт.", "в\n" },
	{ "Пещерный лабиринт.", "св\n" },
	{ "Пещерный лабиринт.", "с\n" },
	{ "Пещерный лабиринт.", "с\n" },
	{ "Пещерный лабиринт.", "сз\n" },
	{ "Пещерный лабиринт.", "в\n" },
	{ "Пещерка отшельника.", "з\n" },
	{ "Пещерный лабиринт.", "юз\n" },
	{ "Пещерный лабиринт.", "ю\n" },
	{ "Пещерный лабиринт.", "з\n" },
	{ "Пещерный лабиринт.", "з\n" },
	{ "Пещерный лабиринт.", "з\n" },
	{ "Пещерный лабиринт.", "з\n" },
	{ "Пещерный лабиринт.", "в\n" },
	{ "Пещерный лабиринт.", "с\n" },
	{ "Пещерный лабиринт.", "сз\n" },
	{ "Пещерный лабиринт.", "вв\n" },
	{ "ЮжнаЯ пещера.", "ю\n" },
	{ "ЮжнаЯ пещера.", "з\n" },
	{ "ЮжнаЯ пещера.", "вв\n" },
	{ "Логово паука.", "вн\n" },
	{ "ЮжнаЯ пещера.", "в\n" },
	{ "ЮжнаЯ пещера.", "с\n" },
	{ "ЮжнаЯ пещера.", "с\n" },
	{ "Вход в пещеру.", "сз\n" },
	{ "СевернаЯ пещера.", "з\n" },
	{ "У наскальных рисунков.", "в\n" },
	{ "СевернаЯ пещера.", "юв\n" },
	{ "Вход в пещеру.", "в\n" },
	{ "У разрушенного моста.", "с\n" },
	{ "Широкое ущелье.", "с\n" },
	{ "Склон горы.", "с\n" },
	{ "", "" }
};


// Аллея

const struct mobData AlleyMob[] = {
	{ "МаленькаЯ птичка сидит на ветке дерева.", "птичка", "МаленькаЯ птичка\e[0;1;31m убита!", 14 },
	{ "Зеленый попугай сбежал из клетки.", "попугай", "Зеленый попугай\e[0;1;31m убит!", 14 },
	{ "Рыжий пекинес неодобрительно смотрит на ваши ноги.", "пекинес", "Пекинес\e[0;1;31m убит!", 14 },
	{ "Ливрейный слуга предлагает вам пройти дальше.", "слуга", "Ливрейный слуга\e[0;1;31m убит!", 14 },
	{ "Дикий виноград оплетает стены беседки.", "виноград", "Дикий виноград\e[0;1;31m убит!", 16 },
	{ "Этот гость хорошо танцует, к тому же, он сама галантность.", "танцующий", "Танцующий гость\e[0;1;31m убит!", 19 },
	{ "Вышколенный официант предлагает вам выпивку.", "официант", "Официант\e[0;1;31m убит!", 19 },
	{ "ХозЯин дома следит, чтобы все было в порЯдке.", "хозяин", "ХозЯин дома\e[0;1;31m убит!", 19 },
	{ "Музыкант играет на роЯле.", "музыкант", "Музыкант\e[0;1;31m убит!", 24 },
	{ "Каменный человечек прислонилсЯ к стене и почти сливаетсЯ с ней.", "человечек", "Каменный человечек\e[0;1;31m убит!", 19 },
	{ "", "", "", 0 }
};

const struct routeData AlleyRoute[] = {
	{ "Начало длинной аллеи.", "с\n" },
	{ "Продолжение длинной аллеи.", "с\n" },
	{ "Площадка с фонтаном.", "в\n" },
	{ "Тропинка.", "в\n" },
	{ "Поворот тропинки.", "с\n" },
	{ "Поворот тропинки.", "в\n" },
	{ "Тропинка.", "в\n" },
	{ "Вход в беседку.", "з\n" },
	{ "Тропинка.", "з\n" },
	{ "Поворот тропинки.", "ю\n" },
	{ "Поворот тропинки.", "з\n" },
	{ "Тропинка.", "з\n" },
	{ "Площадка с фонтаном.", "с\n" },
	{ "АллеЯ.", "с\n" },
	{ "Развилка.", "с\n" },
	{ "Перед коттеджем.", "с\n" },
	{ "Перед дверью.", "открыть север\nсевер\n" },
	{ "ПрихожаЯ.", "открыть запад\nзапад\n" },
	{ "КухнЯ.", "открыть север\nсевер\n" },
	{ "Зал длЯ приемов.", "с\n" },
	{ "Зал длЯ приемов.", "в\n" },
	{ "Зал длЯ приемов.", "в\n" },
	{ "Зал длЯ приемов.", "ю\n" },
	{ "Зал длЯ приемов.", "открыть юг\nюг\n" },
	{ "ВаннаЯ комната.", "открыть запад\nзапад\n" },
	{ "ПрихожаЯ.", "открыть юг\nюг\n" },
	{ "Перед дверью.", "ю\n" },
	{ "Перед коттеджем.", "ю\n" },
	{ "Развилка.", "св\n" },
	{ "Тропка к гроту.", "св\n" },

	{ "Перед гротом.", "св\n" }, /* step 30 */
	{ "Внутри грота.", "в\n" },
	{ "Пещера.", "сз\n" },
	{ "Пещера.", "в\n" },
	{ "Пещера.", "в\n" },
	{ "Пещера.", "ю\n" },
	{ "Пещера.", "в\n" },
	{ "Узкое место.", "юз\n" },
	{ "Пещера.", "з\n" },
	{ "Пещера.", "з\n" },
	{ "Пещера.", "св\n" },
	{ "Пещера.", "з\n" },
	{ "Внутри грота.", "юз\n" },

	{ "Перед гротом.", "юз\n" }, /* skip 43 */
	{ "Тропка к гроту.", "юз\n" },
	{ "Развилка.", "ю\n" },
	{ "АллеЯ.", "ю\n" },
	{ "Площадка с фонтаном.", "ю\n" },
	{ "Продолжение длинной аллеи.", "ю\n" },
	{ "", "" }
};

const struct forkData AlleyFork = { .step = 30, .skip = 43, .minLevel = 22 };


// Разбойничье логово

const struct mobData BanditsMob[] = {
	{ "Стражник разбойников дремлет тут на своем посту.", "стражник", "Стражник\e[0;1;31m убит!", 18 },
	{ "Бандит с рваным ухом и кольцом в носу прилег отдохнуть.", "бандит", "Бандит Рваное Ухо\e[0;1;31m убит!", 24 },
	{ "", "", "", 0 }
};

const struct routeData BanditsRoute[] = {
	{ "СломаннаЯ повозка.", "с\n" },
	{ "В кустах.", "с\n" },
	{ "ЗаросшаЯ тропинка.", "з\n" },
	{ "Густые заросли к западу от тропинки.", "с\n" },
	{ "Густые заросли к западу от тропинки.", "с\n" },
	{ "СкрытаЯ долина.", "с\n" },
	{ "Луга", "с\n" },
	{ "Изгиб тропинки.", "с\n" },
	{ "Тропинка вдоль опушки леса.", "с\n" },
	{ "Тропинка продолжаетсЯ.", "з\n" },
	{ "Тропинка по краю полЯ.", "с\n" },
	{ "Тропинка между лесом и полем.", "з\n" },
	{ "Тропа идет с востока и сворачивает на север.", "с\n" },
	{ "ХорошаЯ тропа идет с юга на север.", "с\n" },
	{ "ХорошаЯ тропа идет с юга на север.", "с\n" },
	{ "Развилка.", "с\n" },
	{ "НеприметнаЯ тропинка.", "в\n" },
	{ "Опушка леса рЯдом с тропинкой.", "в\n" },
	{ "В дебрЯх.", "нажать пенек\n" },
	{ "Начало подземного хода.", "с\n" },
	{ "Подземный ход.", "с\n" },
	{ "Подземный ход продолжаетсЯ.", "с\n" },
	{ "Поворот.", "з\n" },
	{ "Подсобное помещение.", "открыть запад\nзапад\n" },
	{ "Коридор в глубине горы.", "с\n" },
	{ "Коридор в глубине горы.", "с\n" },
	{ "Развилка коридора.", "в\n" },
	{ "Жилой сектор.", "в\n" },
	{ "ОбщаЯ комната.", "открыть юг\nюг\n" },
	{ "СпальнЯ.", "открыть север\nсевер\n" },
	{ "ОбщаЯ комната.", "з\n" },
	{ "Жилой сектор.", "з\n" },
	{ "Развилка коридора.", "ю\n" },
	{ "Коридор в глубине горы.", "ю\n" },
	{ "Коридор в глубине горы.", "ю\n" },
	{ "Коридор в глубине горы.", "открыть запад\nзапад\n" }, /* step 35 */
	{ "Комната охраны.", "открыть восток\nвосток\n" },
	{ "Коридор в глубине горы.", "ю\n" }, /* skip 37 */
	{ "", "" }
};

const struct forkData BanditsFork = { .step = 35, .skip = 37, .minLevel = 24 };


// Дом Беорна

const struct mobData BeornMob[] = {
	{ "БелаЯ овечка щиплет клевер.", "овечка", "БелаЯ овечка\e[0;1;31m убита!", 19 },
	{ "ТолстенькаЯ мышь юркнула из-под ваших ног.", "мышь", "ТолстенькаЯ мышь\e[0;1;31m убита!", 19 },
	{ "Пестрый дЯтел с остервенением долбит клювом ствол дерева.", "дятел", "Пестрый дЯтел\e[0;1;31m убит!", 19 },
	{ "Пони Беорна подчинЯетсЯ только хозЯину.", "пони", "Пони Беорна\e[0;1;31m убит!", 19 },
	{ "ЧернаЯ галка сидит на ветке дерева.", "галка", "ЧернаЯ галка\e[0;1;31m убита!", 19 },
	{ "Взъерошенный медвежонок бродит без привЯзи.", "медвежонок", "Взъерошенный медвежонок\e[0;1;31m убит!", 19 },
	{ "Серый ослик стоит в ожидании хозЯина.", "ослик", "Серый ослик\e[0;1;31m убит!", 24 },
	{ "ПолосатаЯ кошка из породы лесных кошек.", "кошка", "ПолосатаЯ кошка\e[0;1;31m убита!", 24 },
	{ "ОгромнаЯ пчела с полосатым брюшком кружит рЯдом с вами.", "пчела", "ОгромнаЯ пчела\e[0;1;31m убита!", 24 },
	{ "Сторожевой пес выглЯдит умнее своих собратьев.", "умный", "Умный пес\e[0;1;31m убит!", 24 },
	{ "Сторожевой пес готов кинутьсЯ на чужака в любой момент.", "сторожевой", "Сторожевой пес\e[0;1;31m убит!", 24 },
	{ "РезваЯ лошадка стучит копытом о землю.", "резвая", "РезваЯ лошадка\e[0;1;31m убита!", 28 },
	{ "", "", "", 0 }
};

const struct routeData BeornRoute[] = {
	{ "У огромного цветка.", "ю\n" },
	{ "Клеверные луга.", "з\n" },
	{ "Луг.", "з\n" },
	{ "В закутке у дома.", "ю\n" },
	{ "У копны сена.", "ю\n" },
	{ "ДубоваЯ роща.", "ю\n" },
	{ "В глубине дубовой рощи.", "з\n" },
	{ "Под сенью дубов.", "з\n" },
	{ "Под сенью дубов.", "с\n" },
	{ "ДубоваЯ роща.", "в\n" },
	{ "Среди дубов.", "с\n" },
	{ "Тропинка у веранды.", "с\n" },
	{ "Веранда.", "ю\n" },
	{ "Тропинка у веранды.", "з\n" },
	{ "Тропинка вокруг дома.", "з\n" },
	{ "Узкое место.", "с\n" },
	{ "Тропинка вдоль стены дома.", "з\n" },
	{ "Вольер.", "в\n" },
	{ "Тропинка вдоль стены дома.", "с\n" },
	{ "Тропинка вдоль стены дома.", "з\n" },
	{ "Вольер.", "в\n" },
	{ "Тропинка вдоль стены дома.", "с\n" },
	{ "Тропинка вдоль стены дома.", "з\n" },
	{ "В колючих кустах.", "в\n" },
	{ "Тропинка вдоль стены дома.", "с\n" },
	{ "У ворот конюшни.", "открыть запад\nзапад\n" },
	{ "КонюшнЯ.", "открыть восток\nвосток\n" },
	{ "У ворот конюшни.", "в\n" },
	{ "Тропинка вдоль фасада.", "в\n" },
	{ "Центр двора.", "с\n" },
	{ "Дорожка через сад.", "з\n" },
	{ "Заросли смородины.", "з\n" },
	{ "Грушевый сад.", "войти\n" },
	{ "В дупле.", "вв\n" },
	{ "Грушевый сад.", "з\n" },
	{ "Среди Яблонь.", "с\n" },
	{ "Среди Яблонь.", "в\n" },
	{ "Грушевый сад.", "в\n" },
	{ "Ухоженный сад.", "в\n" },
	{ "Дорожка через сад.", "в\n" },
	{ "Ухоженный сад.", "в\n" },
	{ "Сливовые деревьЯ.", "в\n" },
	{ "Сливовые деревьЯ.", "ю\n" },
	{ "Цветущие вишни.", "з\n" },
	{ "Цветущие вишни.", "з\n" },
	{ "Заросли смородины.", "з\n" },
	{ "Дорожка через сад.", "с\n" },
	{ "Дорожка через сад.", "с\n" },
	{ "На дорожке, ведущей к дому.", "з\n" },
	{ "ГудЯщие ульи.", "з\n" },
	{ "У большого ульЯ.", "в\n" },
	{ "ГудЯщие ульи.", "в\n" },
	{ "На дорожке, ведущей к дому.", "в\n" },
	{ "ГудЯщие ульи.", "в\n" },
	{ "ГудЯщие ульи.", "з\n" },
	{ "ГудЯщие ульи.", "з\n" },
	{ "На дорожке, ведущей к дому.", "с\n" },
	{ "Ворота в живой изгороди.", "ю\n" },
	{ "На дорожке, ведущей к дому.", "ю\n" },
	{ "Дорожка через сад.", "ю\n" },
	{ "Дорожка через сад.", "ю\n" },
	{ "Центр двора.", "ю\n" },
	{ "Большой двор.", "открыть юг\nюг\n" },
	{ "Холл.", "з\n" },
	{ "КухнЯ.", "в\n" },
	{ "Холл.", "в\n" },
	{ "СпальнЯ.", "з\n" },
	{ "", "" }
};


// Умбарские гавани

const struct mobData HavensMob[] = {
	{ "Грузчик тащит на своем горбу громадный тюк.", "мешком", "Грузчик с мешком\e[0;1;31m убит!", 23 },
	{ "Бородатый грузчик покраснел от натуги, катЯ здоровенную бочку.", "бородатый", "Бородатый грузчик\e[0;1;31m убит!", 24 },
	{ "Плотник-корабел сосредоточенно стучит топором.", "корабел", "Плотник-корабел\e[0;1;31m убит!", 24 },
	{ "", "", "", 0 }
};

const struct routeData HavensRoute[] = {
	{ "Аптека.", "з\n" },
	{ "ТоварнаЯ улица.", "ю\n" },
	{ "ТоварнаЯ улица.", "з\n" },
	{ "Портовые ворота.", "з\n" },
	{ "Перед воротами.", "з\n" },
	{ "МачтоваЯ дорога.", "з\n" },
	{ "МачтоваЯ дорога.", "з\n" },
	{ "НабережнаЯ.", "ю\n" },
	{ "У пирсов.", "з\n" },
	{ "Пирс.", "в\n" },
	{ "У пирсов.", "ю\n" },
	{ "На пристани.", "з\n" },
	{ "Пирс.", "в\n" },
	{ "На пристани.", "в\n" },
	{ "Перед складами.", "з\n" },
	{ "На пристани.", "с\n" },
	{ "У пирсов.", "юв\n" },
	{ "Припортовый базар.", "ю\n" },
	{ "Невольничий рынок.", "с\n" },
	{ "Припортовый базар.", "с\n" },
	{ "МачтоваЯ дорога.", "с\n" },
	{ "Дорога к верфЯм.", "сз\n" },
	{ "Умбарские верфи.", "з\n" },
	{ "В доке.", "с\n" },
	{ "В доке.", "вв\n" },
	{ "На лесах.", "в\n" },
	{ "На лесах.", "ю\n" },
	{ "На лесах.", "з\n" },
	{ "На лесах.", "с\n" },
	{ "На лесах.", "вн\n" },
	{ "В доке.", "в\n" },
	{ "В доке.", "ю\n" },
	{ "Умбарские верфи.", "юв\n" },
	{ "Дорога к верфЯм.", "ю\n" },
	{ "МачтоваЯ дорога.", "в\n" },
	{ "МачтоваЯ дорога.", "в\n" },
	{ "", "" }
};


// Хутор

const struct mobData SteadingMob[] = {
	{ "Жирный суслик застыл столбиком на обочине дороги.", "суслик", "Толстый суслик\e[0;1;31m убит!", 24 },
	{ "ОгромнаЯ злаЯ собака несетсЯ на вас, обнажив зубы.", "собака", "ЗлаЯ собака\e[0;1;31m убита!", 25 },
	{ "Большой хрЯк похотливо смотрит на молодых свиноматок.", "хряк", "Большой хрЯк\e[0;1;31m убит!", 28 },
	{ "Гормадок Барквин, хозЯин дома, стоит здесь.", "гормадок", "Гормадок Барквин\e[0;1;31m убит!", 28 },
	{ "Черный конь храпит и бьет копытом в нетерпении.", "конь", "Черный конь\e[0;1;31m убит!", 14 },
	{ "БелаЯ лошадь трЯсет своей прекрасной гривой.", "лошадь", "БелаЯ лошадь\e[0;1;31m убита!", 19 },
	{ "Батрак вышел из мельницы покурить и отдохнуть от шума.", "батрак", "Батрак\e[0;1;31m убит!", 14 },
	{ "Батрак не переставаЯ таскает мешки к жерновам.", "батрак", "Батрак\e[0;1;31m убит!", 19 },
	{ "Сердитый мельник наблюдает за процессом.", "сердитый", "Сердитый мельник\e[0;1;31m убит!", 19 },
	{ "Мэй Барквин могла бы выиграть конкурс красоты в Шире.", "мэй", "Мэй Барквин\e[0;1;31m убита!", 34 },
	{ "", "", "", 0 }
};

const struct routeData SteadingRoute[] = {
	{ "ПодъезднаЯ дорога.", "с\n" },
	{ "Перед воротами.", "открыть север\nсевер\n" },
	{ "С внутренней стороны ворот.", "з\n" },
	{ "Начало тенистой аллеи.", "з\n" },
	{ "Угол двора.", "с\n" },
	{ "УзкаЯ тенистаЯ аллеЯ.", "с\n" },
	{ "Пересечение.", "в\n" },
	{ "Двор между сараЯми.", "открыть юг\nюг\n" }, /* step */
	{ "Коровник.", "открыть север\nсевер\n" },
	{ "Двор между сараЯми.", "открыть север\nсевер\n" }, /* skip */
	{ "Свинарник.", "открыть юг\nюг\n" },
	{ "Двор между сараЯми.", "в\n" },
	{ "Куры и гуси. Птичий двор.", "в\n" },
	{ "Возле колодца.", "открыть восток\nвосток\n" },
	{ "Дом Барквинов.", "открыть запад\nзапад\n" },
	{ "Возле колодца.", "с\n" },
	{ "Между сараем и домом.", "с\n" },
	{ "У крыльца.", "з\n" },
	{ "Перед конюшнЯми.", "открыть север\nсевер\n" },
	{ "КонюшнЯ.", "открыть юг\nюг\n" },
	{ "Перед конюшнЯми.", "открыть запад\nзапад\n" },
	{ "Загон длЯ лошадей.", "открыть восток\nвосток\n" },
	{ "Перед конюшнЯми.", "в\n" },
	{ "У крыльца.", "с\n" },
	{ "Между клумбой и конюшней.", "с\n" },
	{ "Вторые ворота.", "открыть север\nсевер\n" },
	{ "Дорога за хутором.", "с\n" },
	{ "Дорога через поле.", "с\n" },
	{ "Дорога бежит под уклон.", "с\n" },
	{ "Дорога.", "с\n" },
	{ "Дорога бежит в низину.", "с\n" },
	{ "Перед оврагом.", "с\n" },
	{ "Овраг.", "з\n" },
	{ "Овраг выше по течению.", "з\n" },
	{ "Перед омутом.", "з\n" },
	{ "Омут.", "с\n" },
	{ "На склоне.", "з\n" },
	{ "МельнЯ.", "в\n" },
	{ "На склоне.", "ю\n" },
	{ "Омут.", "в\n" },
	{ "Перед омутом.", "в\n" },
	{ "Овраг выше по течению.", "в\n" },
	{ "Овраг.", "ю\n" },
	{ "Перед оврагом.", "ю\n" },
	{ "Дорога бежит в низину.", "ю\n" },
	{ "Дорога.", "ю\n" },
	{ "Дорога бежит под уклон.", "ю\n" },
	{ "Дорога через поле.", "ю\n" },
	{ "Дорога за хутором.", "открыть юг\nюг\n" },
	{ "Вторые ворота.", "ю\n" },
	{ "Между клумбой и конюшней.", "ю\n" },
	{ "У крыльца.", "ю\n" },
	{ "Между сараем и домом.", "ю\n" },
	{ "Возле колодца.", "ю\n" },
	{ "Около первых построек.", "юз\n" },
	{ "С внутренней стороны ворот.", "открыть юг\nюг\n" },
	{ "Перед воротами.", "ю\n" },
	{ "", "" }
};

const struct forkData SteadingFork = { .step = 7, .skip = 9, .minLevel = 28 };


// Пещеры алчных гномов

const struct mobData DwarvenMob[] = {
	{ "Франт-гном пришел поразвлечьсЯ.", "франт", "Гном-зритель\e[0;1;31m убит!", 23 },
	{ "СкромнаЯ девица сбежала втихарЯ из дома со своим парнем.", "девица", "Подружка гнома\e[0;1;31m убита!", 26 },
	{ "Каменное дерево смахивает на живое.", "дерево", "Каменное дерево\e[0;1;31m убито!", 28 },
	{ "Хмурый гном с большим топором в руках стоит и смотрит на вас.", "хмурый", "Хмурый гном\e[0;1;31m убит!", 31 },
	{ "", "", "", 0 }
};

const struct routeData DwarvenRoute[] = {
	{ "Окраина заброшенного подземного города гномов.", "в\n" },
	{ "Улицы заброшенного подземного города гномов.", "в\n" },
	{ "Улицы заброшенного подземного города гномов.", "в\n" },
	{ "Улицы заброшенного подземного города гномов.", "в\n" },
	{ "Улицы заброшенного подземного города гномов.", "з\n" },
	{ "Улицы заброшенного подземного города гномов.", "с\n" },
	{ "Вход в торговый дом \"ГНОМСКИЙ\".", "с\n" },
	{ "Начало оружейного рЯда.", "с\n" },
	{ "Середина оружейного рЯда.", "с\n" },
	{ "Конец оружейного рЯда.", "ю\n" },
	{ "Середина оружейного рЯда.", "ю\n" },
	{ "Начало оружейного рЯда.", "ю\n" },
	{ "Вход в торговый дом \"ГНОМСКИЙ\".", "в\n" },
	{ "Доспешный рЯд.", "в\n" },
	{ "Зона развлечений.", "с\n" },
	{ "Билетные кассы.", "дать 10 монет билетер\nсевер\n" },
	{ "Гардероб.", "дать билет контролер\n" },
	{ "Шапито, сектор D.", "з\n" },
	{ "Шапито, сектор E.", "с\n" },
	{ "Шапито, сектор F.", "с\n" },
	{ "Шапито, сектор G.", "в\n" },
	{ "Шапито, оркестр.", "в\n" },
	{ "Шапито, сектор A.", "ю\n" },
	{ "Шапито, сектор B.", "ю\n" },
	{ "Шапито, сектор C.", "з\n" },
	{ "Шапито, сектор D.", "ю\n" },
	{ "Гардероб.", "ю\n" },
	{ "Билетные кассы.", "ю\n" },
	{ "Зона развлечений.", "з\n" },
	{ "Доспешный рЯд.", "з\n" },
	{ "Вход в торговый дом \"ГНОМСКИЙ\".", "ю\n" },
	{ "Улицы заброшенного подземного города гномов.", "з\n" },
	{ "Улицы заброшенного подземного города гномов.", "з\n" },
	{ "Улицы заброшенного подземного города гномов.", "з\n" },
	{ "Окраина заброшенного подземного города гномов.", "открыть север\nсевер\n" },
	{ "", "" }
};


// Шаблон

const struct mobData BlankMob[] = {
	{ "", "", "\e[0;1;31m убит!", 0 },
	{ "", "", "", 0 }
};

const struct routeData BlankRoute[] = {
	{ "", "\n" },
	{ "", "" }
};


// Нора

bool task_exploreHole( void )
{
	if ( task_explore( HoleMob, HoleRoute, &HoleFork ) )
		return true;
	return false;
}


// Забытый приют

bool task_exploreForsaken( void )
{
	if ( task_explore( ForsakenMob, ForsakenRoute, NULL ) )
		return true;
	return false;
}


// Ров вокруг БрылЯ

bool task_exploreMoat( void )
{
	if ( task_explore( MoatMob, MoatRoute, NULL ) )
		return true;
	return false;
}


// ОсобнЯк

bool task_exploreManor( void )
{
	if ( task_explore( ManorMob, ManorRoute, NULL ) )
		return true;
	return false;
}


// Мельница Тэда

bool task_exploreTeds( void )
{
	if ( task_explore( TedsMob, TedsRoute, &TedsFork ) )
		return true;
	return false;
}


// Крапива

bool task_exploreNettle( void )
{
	if ( task_explore( NettleMob, NettleRoute, NULL ) )
		return true;
	return false;
}


// Уводье

bool task_exploreBywater( void )
{
	if ( task_explore( BywaterMob, BywaterRoute, &BywaterFork ) )
		return true;
	return false;
}


// Древлепуща

bool task_exploreForest( void )
{
	if ( task_explore( ForestMob, ForestRoute, NULL ) )
		return true;
	return false;
}


// Усадьба Мэггота

bool task_exploreMaggots( void )
{
	if ( task_explore( MaggotsMob, MaggotsRoute, NULL ) )
		return true;
	return false;
}


// Южные увалы

bool task_exploreSouth( void )
{
	if ( task_explore( SouthMob, SouthRoute, NULL ) )
		return true;
	return false;
}


// Длинная аллея

bool task_exploreAlley( void )
{
	if ( task_explore( AlleyMob, AlleyRoute, &AlleyFork ) )
		return true;
	return false;
}


// Разбойничье логово

bool task_exploreBandits( void )
{
	if ( task_explore( BanditsMob, BanditsRoute, &BanditsFork ) )
		return true;
	return false;
}


// Дом Беорна

bool task_exploreBeorn( void )
{
	if ( task_explore( BeornMob, BeornRoute, NULL ) )
		return true;
	return false;
}


// Хутор

bool task_exploreSteading( void )
{
	if ( task_explore( SteadingMob, SteadingRoute, &SteadingFork ) )
		return true;
	return false;
}


// Умбарские гавани

bool task_exploreHavens( void )
{
	if ( task_explore( HavensMob, HavensRoute, NULL ) )
		return true;
	return false;
}


// Пещеры алчных гномов

bool task_exploreDwarven( void )
{
	if ( task_explore( DwarvenMob, DwarvenRoute, NULL ) )
		return true;
	return false;
}


/*

2	8
3	9
4	11
5	12
7	14
8	15
10	18
12	20
14	22
16	25
19	28
21	30
23	32
24	33
25	35
28	38
30	40


*/
